; domain
;Header and description

(define (domain blocks)

    ;remove requirements that are not needed
    (:requirements :typing :negative-preconditions :conditional-effects)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        location locatable - object
        block agent - locatable
        static dynamic - block
        robot - agent
    )

    ; un-comment following line if constants are needed
    ;(:constants )

    (:predicates ;todo: define predicates here
        (at ?obj - locatable ?loc - location) ; Object ?obj is at location ?loc)
        (on ?block1 - block ?block2 - block)
        (at-top ?block - block) ; Block ?block is at the top of its stack
        (gripper-empty)
        (holding ?robot - robot ?block - block) ; Robot ?robot is holding block ?block
        (path-blocked-from-to ?from - location ?to - location) ; Path from ?from to ?to is blocked
    )

    ; (:functions ;todo: define numeric functions here
    ; )

    ;define actions here
    (:action move
            :parameters (?robot - robot
                         ?from - location
                         ?to - location)

            :precondition (and
                (at ?robot ?from)
                (not (path-blocked-from-to ?from ?to)))

            :effect (and
                (not (at ?robot ?from))
                (at ?robot ?to))
    )

    (:action grasp
        :parameters (?robot - robot
                     ?block - dynamic
                     ?loc - location)

        :precondition (and
                        (at ?robot ?loc)
                        (at ?block ?loc)
                        (gripper-empty)
                        (at-top ?block)
                      )

        :effect (and
                    (not (at ?block ?loc))
                    (holding ?robot ?block)
                    (not (gripper-empty))
                    (not (at-top ?block))
                    (forall (?below_block - block)
                        (when (on ?block ?below_block)
                            (at-top ?below_block)
                        )
                    )
                )
    )

    (:action place
        :parameters (?robot - robot
                     ?block - dynamic
                     ?loc - location)

        :precondition (and
                        (at ?robot ?loc)
                        (holding ?robot ?block)
                        (not (gripper-empty))
                      )

        :effect (and
                    (gripper-empty)
                    (not (holding ?robot ?block))
                    (at ?block ?loc)
                    (at-top ?block)
                    (forall (?below_block - block)
                        (when (and
                                (at ?below_block ?loc)
                                (at-top ?below_block)
                              )
                            (and
                                (not (at-top ?below_block))
                                (on ?block ?below_block)
                            )
                        )
                    )
                )

    )
)

; problem
(define (problem blocks_problem_3)
    (:domain blocks)
    (:objects block_10 block_11 block_2 block_3 block_4 block_5 block_6 block_7 block_8 block_9 - dynamic p1 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p2 p20 p21 p3 p4 p5 p6 p7 p8 p9 - location robot - robot block_1 - static)
    (:init (at block_1 p1) (at block_10 p10) (at block_11 p11) (at block_2 p2) (at block_3 p3) (at block_4 p4) (at block_5 p5) (at block_6 p6) (at block_7 p7) (at block_8 p8) (at block_9 p9) (at robot p12) (at-top block_11) (at-top block_5) (at-top block_8) (gripper-empty) (on block_10 block_9) (on block_11 block_10) (on block_2 block_1) (on block_3 block_2) (on block_4 block_3) (on block_5 block_4) (on block_7 block_6) (on block_8 block_7))
    (:goal (and (at block_2 p13) (at block_3 p14) (at block_4 p15) (at block_5 p16) (at block_6 p17) (at block_7 p18) (at block_8 p19) (at block_9 p20) (at block_10 p21)))
)

; plan
1. (move robot p12 p5)
   deleted: (at robot p12)
   added: (at robot p5)
   goals met: 0 of 9
2. (grasp robot block_5 p5)
   deleted: (at block_5 p5) (gripper-empty) (at-top block_5)
   added: (holding robot block_5) (at-top block_4)
   goals met: 0 of 9
3. (move robot p5 p16)
   deleted: (at robot p5)
   added: (at robot p16)
   goals met: 0 of 9
4. (place robot block_5 p16)
   deleted: (holding robot block_5)
   added: (gripper-empty) (at block_5 p16) (at-top block_5)
   goals met: 1 of 9
5. (move robot p16 p4)
   deleted: (at robot p16)
   added: (at robot p4)
   goals met: 1 of 9
6. (grasp robot block_4 p4)
   deleted: (at block_4 p4) (gripper-empty) (at-top block_4)
   added: (holding robot block_4) (at-top block_3)
   goals met: 1 of 9
7. (move robot p4 p15)
   deleted: (at robot p4)
   added: (at robot p15)
   goals met: 1 of 9
8. (place robot block_4 p15)
   deleted: (holding robot block_4)
   added: (gripper-empty) (at block_4 p15) (at-top block_4)
   goals met: 2 of 9
9. (move robot p15 p3)
   deleted: (at robot p15)
   added: (at robot p3)
   goals met: 2 of 9
10. (grasp robot block_3 p3)
   deleted: (at block_3 p3) (gripper-empty) (at-top block_3)
   added: (holding robot block_3) (at-top block_2)
   goals met: 2 of 9
11. (move robot p3 p14)
   deleted: (at robot p3)
   added: (at robot p14)
   goals met: 2 of 9
12. (place robot block_3 p14)
   deleted: (holding robot block_3)
   added: (gripper-empty) (at block_3 p14) (at-top block_3)
   goals met: 3 of 9
13. (move robot p14 p8)
   deleted: (at robot p14)
   added: (at robot p8)
   goals met: 3 of 9
14. (grasp robot block_8 p8)
   deleted: (at block_8 p8) (gripper-empty) (at-top block_8)
   added: (holding robot block_8) (at-top block_7)
   goals met: 3 of 9
15. (move robot p8 p19)
   deleted: (at robot p8)
   added: (at robot p19)
   goals met: 3 of 9
16. (place robot block_8 p19)
   deleted: (holding robot block_8)
   added: (gripper-empty) (at block_8 p19) (at-top block_8)
   goals met: 4 of 9
17. (move robot p19 p7)
   deleted: (at robot p19)
   added: (at robot p7)
   goals met: 4 of 9
18. (grasp robot block_7 p7)
   deleted: (at block_7 p7) (gripper-empty) (at-top block_7)
   added: (holding robot block_7) (at-top block_6)
   goals met: 4 of 9
19. (move robot p7 p18)
   deleted: (at robot p7)
   added: (at robot p18)
   goals met: 4 of 9
20. (place robot block_7 p18)
   deleted: (holding robot block_7)
   added: (gripper-empty) (at block_7 p18) (at-top block_7)
   goals met: 5 of 9
21. (move robot p18 p11)
   deleted: (at robot p18)
   added: (at robot p11)
   goals met: 5 of 9
22. (grasp robot block_11 p11)
   deleted: (at block_11 p11) (gripper-empty) (at-top block_11)
   added: (holding robot block_11) (at-top block_10)
   goals met: 5 of 9
23. (place robot block_11 p11)
   deleted: (holding robot block_11)
   added: (gripper-empty) (at block_11 p11) (at-top block_11)
   goals met: 5 of 9
24. (move robot p11 p10)
   deleted: (at robot p11)
   added: (at robot p10)
   goals met: 5 of 9
25. (grasp robot block_10 p10)
   deleted: (at block_10 p10) (gripper-empty) (at-top block_10)
   added: (holding robot block_10) (at-top block_9)
   goals met: 5 of 9
26. (move robot p10 p21)
   deleted: (at robot p10)
   added: (at robot p21)
   goals met: 5 of 9
27. (place robot block_10 p21)
   deleted: (holding robot block_10)
   added: (gripper-empty) (at block_10 p21) (at-top block_10)
   goals met: 6 of 9
28. (move robot p21 p2)
   deleted: (at robot p21)
   added: (at robot p2)
   goals met: 6 of 9
29. (grasp robot block_2 p2)
   deleted: (at block_2 p2) (gripper-empty) (at-top block_2)
   added: (holding robot block_2) (at-top block_1)
   goals met: 6 of 9
30. (move robot p2 p13)
   deleted: (at robot p2)
   added: (at robot p13)
   goals met: 6 of 9
31. (place robot block_2 p13)
   deleted: (holding robot block_2)
   added: (gripper-empty) (at block_2 p13) (at-top block_2)
   goals met: 7 of 9
32. (move robot p13 p6)
   deleted: (at robot p13)
   added: (at robot p6)
   goals met: 7 of 9
33. (grasp robot block_6 p6)
   deleted: (at block_6 p6) (gripper-empty) (at-top block_6)
   added: (holding robot block_6)
   goals met: 7 of 9
34. (move robot p6 p17)
   deleted: (at robot p6)
   added: (at robot p17)
   goals met: 7 of 9
35. (place robot block_6 p17)
   deleted: (holding robot block_6)
   added: (gripper-empty) (at block_6 p17) (at-top block_6)
   goals met: 8 of 9
36. (move robot p17 p9)
   deleted: (at robot p17)
   added: (at robot p9)
   goals met: 8 of 9
37. (grasp robot block_9 p9)
   deleted: (at block_9 p9) (gripper-empty) (at-top block_9)
   added: (holding robot block_9)
   goals met: 8 of 9
38. (move robot p9 p20)
   deleted: (at robot p9)
   added: (at robot p20)
   goals met: 8 of 9
39. (place robot block_9 p20)
   deleted: (holding robot block_9)
   added: (gripper-empty) (at block_9 p20) (at-top block_9)
   goals met: 9 of 9
